In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("../Data/Book1.csv")

In [3]:
df.head()

,Sl.No.,Course Code,Course Title,Course Type,Credits,Grade,Exam Month,Result Declared,Course Distribution,Detail View
0,1,CHY1002,Environmental Sciences,TH,3,A,Feb-21,26-Mar-21,NC,NaN
1,2,CSE1001,Problem Solving and Programming,LO,3,S,Feb-21,10-Mar-21,UC,NaN
2,3,EEE1001,Basic Electrical and Electronics Engineering,ETL,3,B,Feb-21,26-Mar-21,PC,NaN
3,4,ENG1903,Advanced Technical English,ELP,2,A,Feb-21,11-Mar-21,UC,NaN
4,5,FRE1001,Francais quotidien,TH,2,S,Feb-21,26-Mar-21,UC,NaN

In [4]:
len(df)

52

In [5]:
a=[]
for i in range(len(df)):
    if df["Grade"][i]=="S":
        a.append(10)
    elif df["Grade"][i]=="A":
        a.append(9)
    elif df["Grade"][i]=="B":
        a.append(8)
    elif df["Grade"][i]=="C":
        a.append(7)
    elif df["Grade"][i]=="D":
        a.append(6)
    elif df["Grade"][i]=="P":
        a.append(0)

In [6]:
df["Grades"]=a

In [7]:
df.describe()

          Sl.No.    Credits  Detail View     Grades
count  52.000000  52.000000          0.0  52.000000
mean   26.500000   2.942308          NaN   8.942308
std    15.154757   1.109910          NaN   1.487378
min     1.000000   1.000000          NaN   0.000000
25%    13.750000   2.000000          NaN   9.000000
50%    26.500000   3.000000          NaN   9.000000
75%    39.250000   4.000000          NaN  10.000000
max    52.000000   4.000000          NaN  10.000000

In [8]:
credits=148
creds=0
cse_total=0

In [14]:
creds=0
cse_total=0
for i in range(0,len(df)):
    if df["Course Distribution"][i]=="PC" or df["Course Distribution"][i]=="UC":
        creds+=df["Credits"][i]
        cse_total+=df["Credits"][i]*df["Grades"][i]

print(cse_total)
print(creds)

927
101

In [16]:
927/101

9.178217821782178

In [ ]:
tsne = TSNE(n_components=2, random_state=42)
X_tsne = tsne.fit_transform(X)

# Plot the results
plt.figure(figsize=(8, 6))
plt.scatter(X_tsne[:, 0], X_tsne[:, 1], c=y, cmap=plt.cm.get_cmap("viridis", 3))
plt.colorbar(ticks=range(3), label='Classes')
plt.title('t-SNE Representation of Iris Dataset')
plt.xlabel('t-SNE Component 1')
plt.ylabel('t-SNE Component 2')
plt.show()